father('Олег Валентинов', 'Юлия Валентинова').
mother('Галина Костюшина', 'Юлия Валентинова').
father('Константин Костюшин', 'Ольга Костюшина').
father('Константин Костюшин', 'Галина Костюшина').
mother('Тамара Потахина', 'Ольга Костюшина').
mother('Тамара Потахина', 'Галина Костюшина').
father('Николай Валентинов', 'Олег Валентинов').
mother('Раиса Ермакова', 'Олег Валентинов').
father('Николай Филиппов', 'Павел Филиппов').
mother('Ольга Костюшина', 'Павел Филиппов').
father('Николай Ермаков', 'Раиса Ермакова').
father('Николай Ермаков', 'Александр Ермаков').
father('Николай Ермаков', 'Любовь Ермакова').
father('Николай Ермаков', 'Алевтина Ермакова').
mother('Елизавета Попова', 'Раиса Ермакова').
mother('Елизавета Попова', 'Александр Ермаков').
mother('Елизавета Попова', 'Любовь Ермакова').
mother('Елизавета Попова', 'Алевтина Ермакова').
father('Семен Валентинов', 'Тамара').
father('Семен Валентинов', 'Николай Валентинов').
mother('Любовь', 'Тамара').
mother('Любовь', 'Николай Валентинов').
father('Фрол Валентинов', 'Семен Валентинов').
mother('София', 'Семен Валентинов').
father('Осип Ковалев', 'Любовь').
father('Александр Кулагин', 'Сергей Кулагин').
mother('Тамара', 'Сергей Кулагин').
father('Владимир Грачев', 'Светлана Грачева').
father('Владимир Грачев', 'Галина').
mother('Алевтина Ермакова', 'Светлана Грачева').
mother('Алевтина Ермакова', 'Галина').
father('Иван Потахин', 'Зоя Потахина').
father('Иван Потахин', 'Тамара Потахина').
father('Иван Потахин', 'Валентина Потахина').
father('Иван Потахин', 'Екатерина Потахина').
father('Иван Потахин', 'Людмила Потахина').
father('Иван Потахин', 'Михаил Потахин').
father('Иван Потахин', 'Александр Потахин').
father('Иван Потахин', 'Василий Потахин').
father('Иван Потахин', 'Нина Потахина').
father('Иван Потахин', 'Мария Потахина').
mother('Прасковья Овсяниковская', 'Зоя Потахина').
mother('Прасковья Овсяниковская', 'Тамара Потахина').
mother('Прасковья Овсяниковская', 'Валентина Потахина').
mother('Прасковья Овсяниковская', 'Екатерина Потахина').
mother('Прасковья Овсяниковская', 'Людмила Потахина').
mother('Прасковья Овсяниковская', 'Михаил Потахин').
mother('Прасковья Овсяниковская', 'Александр Потахин').
mother('Прасковья Овсяниковская', 'Василий Потахин').
mother('Прасковья Овсяниковская', 'Нина Потахина').
mother('Прасковья Овсяниковская', 'Мария Потахина').
father('Николай Петрович Костюшин', 'Константин Костюшин').
father('Николай Петрович Костюшин', 'Дмитрий Костюшин').
father('Николай Петрович Костюшин', 'Валентина Костюшина').
father('Николай Петрович Костюшин', 'Клавдия Костюшина').
father('Николай Петрович Костюшин', 'Зинаида Костюшина').
father('Николай Петрович Костюшин', 'Василий Костюшин').
mother('Александра Семеновна', 'Константин Костюшин').
mother('Александра Семеновна', 'Дмитрий Костюшин').
mother('Александра Семеновна', 'Валентина Костюшина').
mother('Александра Семеновна', 'Клавдия Костюшина').
mother('Александра Семеновна', 'Зинаида Костюшина').
mother('Александра Семеновна', 'Василий Костюшин').
father('Михаил Потахин', 'Ирина Потахина').
father('Михаил Потахин', 'Татьяна Потахина').
mother('Нина', 'Ирина Потахина').
mother('Нина', 'Татьяна Потахина').
father('Александр Потахин', 'Елена Потахина').
mother('Екатерина', 'Елена Потахина').
father('Алексей Макрухин', 'Юрий Макрухин').
father('Алексей Макрухин', 'Алексей Макрухин').
mother('Валентина Потахина', 'Юрий Макрухин').
mother('Валентина Потахина', 'Алексей Макрухин').
father('Юрий Климов', 'Светлана Климова').
father('Юрий Климов', 'Василий Климов').
mother('Екатерина Потахина', 'Светлана Климова').
mother('Екатерина Потахина', 'Василий Климов').
father('Семен Пайдемиров', 'Светлана Пайдемирова').
mother('Людмила Потахина', 'Светлана Пайдемирова').
father('Иван Данилочкин', 'Сергей Данилочкин').
father('Иван Данилочкин', 'Алексей').
mother('Мария Потахина', 'Сергей Данилочкин').
mother('Мария Потахина', 'Алексей').
father('Василий Костюшин', 'Надежда Костюшина').
father('Василий Костюшин', 'Елена Костюшина').
father('Василий Костюшин', 'Сергей Костюшин').
mother('Евдокия', 'Надежда Костюшина').
mother('Евдокия', 'Елена Костюшина').
mother('Евдокия', 'Сергей Костюшин').
father('Дмитрий Костюшин', 'Галина Костюшин').
father('Дмитрий Костюшин', 'Лидия Костюшин').
father('Дмитрий Костюшин', 'Татьяна Костюшин').
father('Дмитрий Костюшин', 'Николай Костюшин').
mother('Раиса', 'Галина Костюшин').
mother('Раиса', 'Лидия Костюшин').
mother('Раиса', 'Татьяна Костюшин').
mother('Раиса', 'Николай Костюшин').
father('Виктор Левин', 'Николай').
father('Виктор Левин', 'Александр').
mother('Валентина Костюшина', 'Николай').
mother('Валентина Костюшина', 'Александр').
mother('Клавдия Костюшина', 'Наталья Мырова').
father('Иван Горячев', 'Светлана Горячева').
father('Иван Горячев', 'Сергей Горячев').
mother('Зинаида Костюшина', 'Светлана Горячева').
mother('Зинаида Костюшина', 'Сергей Горячев').
mother('Зоя Потахина', 'Наташа Башмакова').
father('Александр Ермаков', 'Елена').
father('Александр Ермаков', 'Екатерина').
mother('Светлана Грачева', 'Анастасия Берлина').
father('Никифор Ермаков', 'Николай Ермаков').
mother('Дарья', 'Николай Ермаков').
father('Степан Попов', 'Елизавета Попова').
father('Сергей Валентинов', 'Фрол Валентинов').
father('Евгений', 'София').
father('Александр Никифоров', 'Екатерина Никифорова').
mother('Светлана Пайдемирова', 'Екатерина Никифорова').
father('Сергей Горячев', 'Роман Горячев').
father('Сергей Горячев', 'Марина Горячева').
mother('Елена', 'Роман Горячев').
mother('Елена', 'Марина Горячева').
father('Андрей Колесников', 'Антон Колесников').
mother('Светлана Горячева', 'Антон Колесников').
mother('Лидия Костюшин', 'Марина').
father('Андрей Лукьянов', 'Наталья Лукьянова').
father('Андрей Лукьянов', 'Иван Лукьянов').
mother('Галина Костюшин', 'Наталья Лукьянова').
mother('Галина Костюшин', 'Иван Лукьянов').
father('Сергей Костюшин', 'Кристина Костюшина').
mother('Елена', 'Кристина Костюшина').
father('Сергей Струнков', 'Ирина Стрункова').
mother('Светлана Горячева', 'Ирина Стрункова').
father('Павел Филиппов', 'Мария Филиппова').
mother('Людмила Сергеевна Рощина', 'Мария Филиппова').
father('Николай Костюшин', 'Константин Костюшин').
mother('Надежда', 'Константин Костюшин').
father('Борис Милешин', 'Кирилл Милешин').
mother('Наталья Мырова', 'Кирилл Милешин').
father('Кирилл Милешин', 'Варвара Милешина').
mother('Елена', 'Варвара Милешина').
mother('Наталья Лукьянова', 'Вероника Анохина').
father('Сергей Данилочкин', 'Илья Данилочкин').
mother('Надежда', 'Илья Данилочкин').
father('Олег Валентинов', 'Юлия Валентинова').
mother('Галина Костюшина', 'Юлия Валентинова').
father('Константин Костюшин', 'Ольга Костюшина').
father('Константин Костюшин', 'Галина Костюшина').
mother('Тамара Потахина', 'Ольга Костюшина').
mother('Тамара Потахина', 'Галина Костюшина').
father('Николай Валентинов', 'Олег Валентинов').
mother('Раиса Ермакова', 'Олег Валентинов').
father('Николай Филиппов', 'Павел Филиппов').
mother('Ольга Костюшина', 'Павел Филиппов').
father('Николай Ермаков', 'Раиса Ермакова').
father('Николай Ермаков', 'Александр Ермаков').
father('Николай Ермаков', 'Любовь Ермакова').
father('Николай Ермаков', 'Алевтина Ермакова').
mother('Елизавета Попова', 'Раиса Ермакова').
mother('Елизавета Попова', 'Александр Ермаков').
mother('Елизавета Попова', 'Любовь Ермакова').
mother('Елизавета Попова', 'Алевтина Ермакова').
father('Семен Валентинов', 'Тамара').
father('Семен Валентинов', 'Николай Валентинов').
mother('Любовь', 'Тамара').
mother('Любовь', 'Николай Валентинов').
father('Фрол Валентинов', 'Семен Валентинов').
mother('София', 'Семен Валентинов').
father('Осип Ковалев', 'Любовь').
father('Александр Кулагин', 'Сергей Кулагин').
mother('Тамара', 'Сергей Кулагин').
father('Владимир Грачев', 'Светлана Грачева').
father('Владимир Грачев', 'Галина').
mother('Алевтина Ермакова', 'Светлана Грачева').
mother('Алевтина Ермакова', 'Галина').
father('Иван Потахин', 'Зоя Потахина').
father('Иван Потахин', 'Тамара Потахина').
father('Иван Потахин', 'Валентина Потахина').
father('Иван Потахин', 'Екатерина Потахина').
father('Иван Потахин', 'Людмила Потахина').
father('Иван Потахин', 'Михаил Потахин').
father('Иван Потахин', 'Александр Потахин').
father('Иван Потахин', 'Василий Потахин').
father('Иван Потахин', 'Нина Потахина').
father('Иван Потахин', 'Мария Потахина').
mother('Прасковья Овсяниковская', 'Зоя Потахина').
mother('Прасковья Овсяниковская', 'Тамара Потахина').
mother('Прасковья Овсяниковская', 'Валентина Потахина').
mother('Прасковья Овсяниковская', 'Екатерина Потахина').
mother('Прасковья Овсяниковская', 'Людмила Потахина').
mother('Прасковья Овсяниковская', 'Михаил Потахин').
mother('Прасковья Овсяниковская', 'Александр Потахин').
mother('Прасковья Овсяниковская', 'Василий Потахин').
mother('Прасковья Овсяниковская', 'Нина Потахина').
mother('Прасковья Овсяниковская', 'Мария Потахина').
father('Николай Петрович Костюшин', 'Константин Костюшин').
father('Николай Петрович Костюшин', 'Дмитрий Костюшин').
father('Николай Петрович Костюшин', 'Валентина Костюшина').
father('Николай Петрович Костюшин', 'Клавдия Костюшина').
father('Николай Петрович Костюшин', 'Зинаида Костюшина').
father('Николай Петрович Костюшин', 'Василий Костюшин').
mother('Александра Семеновна', 'Константин Костюшин').
mother('Александра Семеновна', 'Дмитрий Костюшин').
mother('Александра Семеновна', 'Валентина Костюшина').
mother('Александра Семеновна', 'Клавдия Костюшина').
mother('Александра Семеновна', 'Зинаида Костюшина').
mother('Александра Семеновна', 'Василий Костюшин').
father('Михаил Потахин', 'Ирина Потахина').
father('Михаил Потахин', 'Татьяна Потахина').
mother('Нина', 'Ирина Потахина').
mother('Нина', 'Татьяна Потахина').
father('Александр Потахин', 'Елена Потахина').
mother('Екатерина', 'Елена Потахина').
father('Алексей Макрухин', 'Юрий Макрухин').
father('Алексей Макрухин', 'Алексей Макрухин').
mother('Валентина Потахина', 'Юрий Макрухин').
mother('Валентина Потахина', 'Алексей Макрухин').
father('Юрий Климов', 'Светлана Климова').
father('Юрий Климов', 'Василий Климов').
mother('Екатерина Потахина', 'Светлана Климова').
mother('Екатерина Потахина', 'Василий Климов').
father('Семен Пайдемиров', 'Светлана Пайдемирова').
mother('Людмила Потахина', 'Светлана Пайдемирова').
father('Иван Данилочкин', 'Сергей Данилочкин').
father('Иван Данилочкин', 'Алексей').
mother('Мария Потахина', 'Сергей Данилочкин').
mother('Мария Потахина', 'Алексей').
father('Василий Костюшин', 'Надежда Костюшина').
father('Василий Костюшин', 'Елена Костюшина').
father('Василий Костюшин', 'Сергей Костюшин').
mother('Евдокия', 'Надежда Костюшина').
mother('Евдокия', 'Елена Костюшина').
mother('Евдокия', 'Сергей Костюшин').
father('Дмитрий Костюшин', 'Галина Костюшин').
father('Дмитрий Костюшин', 'Лидия Костюшин').
father('Дмитрий Костюшин', 'Татьяна Костюшин').
father('Дмитрий Костюшин', 'Николай Костюшин').
mother('Раиса', 'Галина Костюшин').
mother('Раиса', 'Лидия Костюшин').
mother('Раиса', 'Татьяна Костюшин').
mother('Раиса', 'Николай Костюшин').
father('Виктор Левин', 'Николай').
father('Виктор Левин', 'Александр').
mother('Валентина Костюшина', 'Николай').
mother('Валентина Костюшина', 'Александр').
mother('Клавдия Костюшина', 'Наталья Мырова').
father('Иван Горячев', 'Светлана Горячева').
father('Иван Горячев', 'Сергей Горячев').
mother('Зинаида Костюшина', 'Светлана Горячева').
mother('Зинаида Костюшина', 'Сергей Горячев').
mother('Зоя Потахина', 'Наташа Башмакова').
father('Александр Ермаков', 'Елена').
father('Александр Ермаков', 'Екатерина').
mother('Светлана Грачева', 'Анастасия Берлина').
father('Никифор Ермаков', 'Николай Ермаков').
mother('Дарья', 'Николай Ермаков').
father('Степан Попов', 'Елизавета Попова').
father('Сергей Валентинов', 'Фрол Валентинов').
father('Евгений', 'София').
father('Александр Никифоров', 'Екатерина Никифорова').
mother('Светлана Пайдемирова', 'Екатерина Никифорова').
father('Сергей Горячев', 'Роман Горячев').
father('Сергей Горячев', 'Марина Горячева').
mother('Елена', 'Роман Горячев').
mother('Елена', 'Марина Горячева').
father('Андрей Колесников', 'Антон Колесников').
mother('Светлана Горячева', 'Антон Колесников').
mother('Лидия Костюшин', 'Марина').
father('Андрей Лукьянов', 'Наталья Лукьянова').
father('Андрей Лукьянов', 'Иван Лукьянов').
mother('Галина Костюшин', 'Наталья Лукьянова').
mother('Галина Костюшин', 'Иван Лукьянов').
father('Сергей Костюшин', 'Кристина Костюшина').
mother('Елена', 'Кристина Костюшина').
father('Сергей Струнков', 'Ирина Стрункова').
mother('Светлана Горячева', 'Ирина Стрункова').
father('Павел Филиппов', 'Мария Филиппова').
mother('Людмила Сергеевна Рощина', 'Мария Филиппова').
father('Николай Костюшин', 'Константин Костюшин').
mother('Надежда', 'Константин Костюшин').
father('Борис Милешин', 'Кирилл Милешин').
mother('Наталья Мырова', 'Кирилл Милешин').
father('Кирилл Милешин', 'Варвара Милешина').
mother('Елена', 'Варвара Милешина').
mother('Наталья Лукьянова', 'Вероника Анохина').
father('Сергей Данилочкин', 'Илья Данилочкин').
mother('Надежда', 'Илья Данилочкин').
male('Илья Данилочкин').
female('Надежда').
male('Алексей Макрухин').
male('Юрий Макрухин').
female('Вероника Анохина').
female('Варвара Милешина').
female('Елена').
male('Борис Милешин').
male('Кирилл Милешин').
male('Константин Костюшин').
female('Надежда').
female('Мария Филиппова').
female('Людмила Сергеевна Рощина').
female('Ирина Стрункова').
male('Сергей Струнков').
female('Кристина Костюшина').
female('Елена').
male('Юрий').
male('Иван Лукьянов').
male('Андрей Лукьянов').
female('Наталья Лукьянова').
female('Марина').
male('Андрей Колесников').
male('Антон Колесников').
female('Марина Горячева').
female('Елена').
male('Роман Горячев').
male('Александр Никифоров').
female('Екатерина Никифорова').
male('Алексей').
female('Елена Потахина').
female('Татьяна Потахина').
female('Ирина Потахина').
female('Светлана Пайдемирова').
male('Василий Климов').
female('Светлана Климова').
female('Дарья').
male('Евгений').
female('София').
male('Сергей Валентинов').
male('Степан Попов').
male('Никифор Ермаков').
female('Анастасия Берлина').
female('Екатерина').
female('Елена').
male('Сергей Данилочкин').
female('Наташа Башмакова').
male('Александр').
male('Николай').
male('Сергей Горячев').
male('Иван Горячев').
female('Светлана Горячева').
female('Елена Костюшина').
female('Надежда Костюшина').
male('Сергей Костюшин').
male('Николай Костюшин').
female('Татьяна Костюшин').
female('Лидия Костюшин').
female('Галина Костюшин').
female('Наталья Мырова').
male('Виктор Левин').
female('Раиса').
female('Евдокия').
male('Иван Данилочкин').
male('Семен Пайдемиров').
male('Юрий Климов').
male('Алексей Макрухин').
female('Екатерина').
female('Нина').
male('Дмитрий Костюшин').
male('Василий Костюшин').
female('Зинаида Костюшина').
female('Клавдия Костюшина').
female('Валентина Костюшина').
female('Нина Потахина').
male('Василий Потахин').
male('Александр Потахин').
male('Михаил Потахин').
male('Павел Филиппов').
female('Людмила Потахина').
female('Екатерина Потахина').
female('Валентина Потахина').
female('Мария Потахина').
female('Зоя Потахина').
male('Николай Петрович Костюшин').
female('Александра Семеновна').
male('Иван Потахин').
female('Прасковья Овсяниковская').
female('Галина').
female('Светлана Грачева').
male('Владимир Грачев').
female('Алевтина Ермакова').
female('Любовь Ермакова').
male('Александр Ермаков').
male('Александр Кулагин').
male('Сергей Кулагин').
female('Тамара').
male('Осип Ковалев').
male('Фрол Валентинов').
male('Семен Валентинов').
female('Любовь').
male('Николай Ермаков').
female('Елизавета Попова').
male('Николай Филиппов').
female('Ольга Костюшина').
male('Николай Валентинов').
female('Раиса Ермакова').
male('Константин Костюшин').
female('Тамара Потахина').
female('Юлия Валентинова').
female('Галина Костюшина').
male('Олег Валентинов').
